<a href="https://colab.research.google.com/github/remart90/Some-snippets/blob/master/New_column_in_Pandas_get_column_name_by_condition_in_rows.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'id':['a', 'b', 'c', 'd'], 'col1':[0, 1, 0, 1], 'col2':[1, 0, 0, 0], 'col3':[0, 0, 1, 0]}

df = pd.DataFrame(d)

In [3]:
df

  id  col1  col2  col3
0  a     0     1     0
1  b     1     0     0
2  c     0     0     1
3  d     1     0     0

In [4]:
# I need 'col_res' with values: 'col2', 'col1', 'col3', 'col1'
# Sum of values for ['col1',  'col2', 'col3'] over row is always 1 (only one value 1, others are zeros)

In [5]:
cols = ['col1',  'col2', 'col3']

In [6]:
def col_for_single_1_in_row(df, list_cols, new_col_name):
  w = []
  for i in range(len(df)):
    s = df.loc[i, list_cols]==1
    e = [ind for ind, x in enumerate(s) if x==True]
    w.append(list_cols[e[0]])
  df[new_col_name] = w
  return df

In [7]:
df = col_for_single_1_in_row(df, cols, 'col_res')

In [8]:
df

  id  col1  col2  col3 col_res
0  a     0     1     0    col2
1  b     1     0     0    col1
2  c     0     0     1    col3
3  d     1     0     0    col1